TexasInstruments/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_npu.h
/*****************************************************************************

  Copyright (C) 2022 Texas Instruments Incorporated - http://www.ti.com/ 

  Redistribution and use in source and binary forms, with or without 
  modification, are permitted provided that the following conditions 
  are met:

   Redistributions of source code must retain the above copyright 
   notice, this list of conditions and the following disclaimer.

   Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the 
   documentation and/or other materials provided with the   
   distribution.

   Neither the name of Texas Instruments Incorporated nor the names of
   its contributors may be used to endorse or promote products derived
   from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*****************************************************************************/

#ifndef ti_devices_msp_peripherals_hw_NPU__include
#define ti_devices_msp_peripherals_hw_NPU__include

/* This preliminary header file does not have a version number */
/* MMR repo: https://bitbucket.itg.ti.com/projects/cmcu_msp65ip/repos/f65mspNPU */
/* MMR revision: 6c55eebd30e67cec8845b250f0f6bee6d28ea20b */
/* Generator revision: b130192d23745dee22048f2279d2827836bc52d4
   (MInT: ec7ec7482a60c6871be32db8b378ec27aa4771f6) */

#ifndef __CORTEX_M
  #ifdef __cplusplus
    #define __I  volatile        /*!< Defines 'read only' permissions */
  #else
    #define __I  volatile const  /*!< Defines 'read only' permissions */
  #endif
  #define __O  volatile          /*!< Defines 'write only' permissions */
  #define __IO  volatile         /*!< Defines 'read / write' permissions */

  /* following defines should be used for structure members */
  #define __IM  volatile const   /*! Defines 'read only' structure member permissions */
  #define __OM  volatile         /*! Defines 'write only' structure member permissions */
  #define __IOM  volatile        /*! Defines 'read / write' structure member permissions */
#endif

/* Use standard integer types with explicit width */
#include <stdint.h>

#ifdef __cplusplus
 extern "C" {
#endif

#if defined ( __CC_ARM )
#pragma anon_unions
#endif

/******************************************************************************
* NPU Registers
******************************************************************************/
#define NPU_REGFILE_OFS                    ((uint32_t)0x00002800U)
#define NPU_INSTMEM_OFS                    ((uint32_t)0x00002000U)
#define NPU_ACCREG_OFS                     ((uint32_t)0x00001C00U)
#define NPU_ADDRREG_OFS                    ((uint32_t)0x00001154U)
#define NPU_LCREG_OFS                      ((uint32_t)0x00001138U)
#define NPU_INT_EVENT_OFS                  ((uint32_t)0x00001020U)
#define NPU_GPRCM_OFS                      ((uint32_t)0x00000800U)


/** @addtogroup NPU_REGFILE
  @{
*/

typedef struct {
  __IO uint32_t RFDATA[512];                       /* !< (@ 0x00002800) Register file data. */
} NPU_REGFILE_Regs;

/*@}*/ /* end of group NPU_REGFILE */

/** @addtogroup NPU_INSTMEM
  @{
*/

typedef struct {
  __IO uint32_t INSTMEM[256];                      /* !< (@ 0x00002000) Instruction memory word. */
} NPU_INSTMEM_Regs;

/*@}*/ /* end of group NPU_INSTMEM */

/** @addtogroup NPU_ACCREG
  @{
*/

typedef struct {
  __IO uint32_t ACCVAL[32];                        /* !< (@ 0x00001C00) Register file data. */
} NPU_ACCREG_Regs;

/*@}*/ /* end of group NPU_ACCREG */

/** @addtogroup NPU_ADDRREG
  @{
*/

typedef struct {
  __IO uint32_t AREG[20];                          /* !< (@ 0x00001154) Address registers. */
} NPU_ADDRREG_Regs;

/*@}*/ /* end of group NPU_ADDRREG */

/** @addtogroup NPU_LCREG
  @{
*/

typedef struct {
  __IO uint32_t LC[6];                             /* !< (@ 0x00001138) Loop count registers. */
} NPU_LCREG_Regs;

/*@}*/ /* end of group NPU_LCREG */

/** @addtogroup NPU_INT_EVENT
  @{
*/

typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00001020) Interrupt index */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00001028) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00001030) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00001038) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00001040) Interrupt set */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00001048) Interrupt clear */
} NPU_INT_EVENT_Regs;

/*@}*/ /* end of group NPU_INT_EVENT */

/** @addtogroup NPU_GPRCM
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00000800) Power enable */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00000804) Reset Control */
       uint32_t RESERVED0[3];
  __I  uint32_t STAT;                              /* !< (@ 0x00000814) Status Register */
} NPU_GPRCM_Regs;

/*@}*/ /* end of group NPU_GPRCM */

/** @addtogroup NPU
  @{
*/

typedef struct {
       uint32_t RESERVED0[512];
  NPU_GPRCM_Regs  GPRCM;                             /* !< (@ 0x00000800) */
       uint32_t RESERVED1[514];
  NPU_INT_EVENT_Regs  INT_EVENT;                         /* !< (@ 0x00001020) */
       uint32_t RESERVED2[37];
  __I  uint32_t EVT_MODE;                          /* !< (@ 0x000010E0) 'Event Mode' */
       uint32_t RESERVED3[6];
  __I  uint32_t DESC;                              /* !< (@ 0x000010FC) Module Description Register */
       uint32_t RESERVED4[8];
  __IO uint32_t CTL5;                              /* !< (@ 0x00001120) CTL5 register */
  __IO uint32_t CTL4;                              /* !< (@ 0x00001124) */
  __IO uint32_t CTL3;                              /* !< (@ 0x00001128) */
  __IO uint32_t CTL2;                              /* !< (@ 0x0000112C) CTL2 register */
  __IO uint32_t CTL1;                              /* !< (@ 0x00001130) CTL1 register */
  __IO uint32_t CTL0;                              /* !< (@ 0x00001134) CTL0 register */
  NPU_LCREG_Regs  LCREG;                             /* !< (@ 0x00001138) */
  __IO uint32_t PC;                                /* !< (@ 0x00001150) Program count register */
  NPU_ADDRREG_Regs  ADDRREG;                           /* !< (@ 0x00001154) */
       uint32_t RESERVED5[347];
  __IO uint32_t DATAIN[2];                         /* !< (@ 0x00001710) Input Data registers, used to load data from
                                                      memory. */
       uint32_t RESERVED6[2];
  __IO uint32_t DATAOUT;                           /* !< (@ 0x00001720) Output Data registers, used to store data to
                                                      memory. */
       uint32_t RESERVED7[3];
  __IO uint32_t SS0LOW;                            /* !< (@ 0x00001730) Scale and shift register 0, lower 32 bits. */
  __IO uint32_t SS0HIGH;                           /* !< (@ 0x00001734) Scale and shift register 0, upper 32 bits. */
  __IO uint32_t SS1LOW;                            /* !< (@ 0x00001738) Scale and shift register 1, lower 32 bits. */
  __IO uint32_t SS1HIGH;                           /* !< (@ 0x0000173C) Scale and shift register 1, upper 32 bits. */
       uint32_t RESERVED8[4];
  __IO uint32_t WGHT0LOW;                          /* !< (@ 0x00001750) Weight register 0, lower 32 bits. */
  __IO uint32_t WGHT0HIGH;                         /* !< (@ 0x00001754) Weight register 0, upper 32 bits. */
  __IO uint32_t WGHT1LOW;                          /* !< (@ 0x00001758) Weight register 1, lower 32 bits. */
  __IO uint32_t WGHT1HIGH;                         /* !< (@ 0x0000175C) Weight register 1, upper 32 bits. */
       uint32_t RESERVED9[296];
  NPU_ACCREG_Regs  ACCREG;                            /* !< (@ 0x00001C00) */
       uint32_t RESERVED10[224];
  NPU_INSTMEM_Regs  INSTMEM;                           /* !< (@ 0x00002000) */
       uint32_t RESERVED11[256];
  NPU_REGFILE_Regs  REGFILE;                           /* !< (@ 0x00002800) */
} NPU_Regs;

/*@}*/ /* end of group NPU */



#if defined ( __CC_ARM )
#pragma no_anon_unions
#endif

