TexasInstruments/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_npu.h
/******************************************************************************
* NPU Register Control Bits
******************************************************************************/

/* NPU_RFDATA Bits */
/* NPU_RFDATA[DATA] Bits */
#define NPU_RFDATA_DATA_OFS                (0)                             /* !< DATA Offset */
#define NPU_RFDATA_DATA_MASK               ((uint32_t)0xFFFFFFFFU)         /* !< Data word. */

/* NPU_INSTMEM_INSTMEM Bits */
/* NPU_INSTMEM_INSTMEM[MEM] Bits */
#define NPU_INSTMEM_INSTMEM_MEM_OFS        (0)                             /* !< MEM Offset */
#define NPU_INSTMEM_INSTMEM_MEM_MASK       ((uint32_t)0xFFFFFFFFU)         /* !< Instruction memory word. */

/* NPU_ACCVAL Bits */
/* NPU_ACCVAL[DATA] Bits */
#define NPU_ACCVAL_DATA_OFS                (0)                             /* !< DATA Offset */
#define NPU_ACCVAL_DATA_MASK               ((uint32_t)0x0003FFFFU)         /* !< Data word. */

/* NPU_AREG Bits */
/* NPU_AREG[DATA] Bits */
#define NPU_AREG_DATA_OFS                  (0)                             /* !< DATA Offset */
#define NPU_AREG_DATA_MASK                 ((uint32_t)0x0000FFFFU)         /* !< Data word. */

/* NPU_LC Bits */
/* NPU_LC[CNT] Bits */
#define NPU_LC_CNT_OFS                     (0)                             /* !< CNT Offset */
#define NPU_LC_CNT_MASK                    ((uint32_t)0x0000FFFFU)         /* !< Loop count. */

/* NPU_IIDX Bits */
/* NPU_IIDX[STAT] Bits */
#define NPU_IIDX_STAT_OFS                  (0)                             /* !< STAT Offset */
#define NPU_IIDX_STAT_MASK                 ((uint32_t)0x000000FFU)         /* !< Interrupt index status */
#define NPU_IIDX_STAT_NO_INTR              ((uint32_t)0x00000000U)         /* !< No interrupt pending */
#define NPU_IIDX_STAT_DONE                 ((uint32_t)0x00000001U)         /* !< Done indication interrupt */

/* NPU_IMASK Bits */
/* NPU_IMASK[DONE] Bits */
#define NPU_IMASK_DONE_OFS                 (0)                             /* !< DONE Offset */
#define NPU_IMASK_DONE_MASK                ((uint32_t)0x00000001U)         /* !< DONE interrupt */
#define NPU_IMASK_DONE_CLR                 ((uint32_t)0x00000000U)         /* !< Disable Event */
#define NPU_IMASK_DONE_SET                 ((uint32_t)0x00000001U)         /* !< Enable Event */

/* NPU_RIS Bits */
/* NPU_RIS[DONE] Bits */
#define NPU_RIS_DONE_OFS                   (0)                             /* !< DONE Offset */
#define NPU_RIS_DONE_MASK                  ((uint32_t)0x00000001U)         /* !< DONE interrupt */
#define NPU_RIS_DONE_CLR                   ((uint32_t)0x00000000U)         /* !< Disable Event */
#define NPU_RIS_DONE_SET                   ((uint32_t)0x00000001U)         /* !< Enable Event */

/* NPU_MIS Bits */
/* NPU_MIS[DONE] Bits */
#define NPU_MIS_DONE_OFS                   (0)                             /* !< DONE Offset */
#define NPU_MIS_DONE_MASK                  ((uint32_t)0x00000001U)         /* !< DONE interrupt */
#define NPU_MIS_DONE_CLR                   ((uint32_t)0x00000000U)         /* !< Disable Event */
#define NPU_MIS_DONE_SET                   ((uint32_t)0x00000001U)         /* !< Enable Event */

/* NPU_ISET Bits */
/* NPU_ISET[DONE] Bits */
#define NPU_ISET_DONE_OFS                  (0)                             /* !< DONE Offset */
#define NPU_ISET_DONE_MASK                 ((uint32_t)0x00000001U)         /* !< DONE interrupt */
#define NPU_ISET_DONE_CLR                  ((uint32_t)0x00000000U)         /* !< Disable Event */
#define NPU_ISET_DONE_SET                  ((uint32_t)0x00000001U)         /* !< Enable Event */

/* NPU_ICLR Bits */
/* NPU_ICLR[DONE] Bits */
#define NPU_ICLR_DONE_OFS                  (0)                             /* !< DONE Offset */
#define NPU_ICLR_DONE_MASK                 ((uint32_t)0x00000001U)         /* !< DONE interrupt */
#define NPU_ICLR_DONE_CLR                  ((uint32_t)0x00000000U)         /* !< Disable Event */
#define NPU_ICLR_DONE_SET                  ((uint32_t)0x00000001U)         /* !< Enable Event */

/* NPU_PWREN Bits */
/* NPU_PWREN[ENABLE] Bits */
#define NPU_PWREN_ENABLE_OFS               (0)                             /* !< ENABLE Offset */
#define NPU_PWREN_ENABLE_MASK              ((uint32_t)0x00000001U)         /* !< Enable the power */
#define NPU_PWREN_ENABLE_DISABLE           ((uint32_t)0x00000000U)         /* !< Disable Power */
#define NPU_PWREN_ENABLE_ENABLE            ((uint32_t)0x00000001U)         /* !< Enable Power */
/* NPU_PWREN[KEY] Bits */
#define NPU_PWREN_KEY_OFS                  (24)                            /* !< KEY Offset */
#define NPU_PWREN_KEY_MASK                 ((uint32_t)0xFF000000U)         /* !< KEY to allow Power State Change */
#define NPU_PWREN_KEY_UNLOCK_W             ((uint32_t)0x26000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* NPU_RSTCTL Bits */
/* NPU_RSTCTL[RESETSTKYCLR] Bits */
#define NPU_RSTCTL_RESETSTKYCLR_OFS        (1)                             /* !< RESETSTKYCLR Offset */
#define NPU_RSTCTL_RESETSTKYCLR_MASK       ((uint32_t)0x00000002U)         /* !< Clear the RESETSTKY bit in the STAT
                                                                                    register */
#define NPU_RSTCTL_RESETSTKYCLR_NOP        ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define NPU_RSTCTL_RESETSTKYCLR_CLR        ((uint32_t)0x00000002U)         /* !< Clear reset sticky bit */
/* NPU_RSTCTL[RESETASSERT] Bits */
#define NPU_RSTCTL_RESETASSERT_OFS         (0)                             /* !< RESETASSERT Offset */
#define NPU_RSTCTL_RESETASSERT_MASK        ((uint32_t)0x00000001U)         /* !< Assert reset to the peripheral */
#define NPU_RSTCTL_RESETASSERT_NOP         ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define NPU_RSTCTL_RESETASSERT_ASSERT      ((uint32_t)0x00000001U)         /* !< Assert reset */
/* NPU_RSTCTL[KEY] Bits */
#define NPU_RSTCTL_KEY_OFS                 (24)                            /* !< KEY Offset */
#define NPU_RSTCTL_KEY_MASK                ((uint32_t)0xFF000000U)         /* !< Unlock key */
#define NPU_RSTCTL_KEY_UNLOCK_W            ((uint32_t)0xB1000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* NPU_STAT Bits */
/* NPU_STAT[RESETSTKY] Bits */
#define NPU_STAT_RESETSTKY_OFS             (16)                            /* !< RESETSTKY Offset */
#define NPU_STAT_RESETSTKY_MASK            ((uint32_t)0x00010000U)         /* !< This bit indicates, if the
                                                                                    peripheral was reset, since this bit
                                                                                    was cleared by RESETSTKYCLR in the
                                                                                    RSTCTL register */
#define NPU_STAT_RESETSTKY_NORES           ((uint32_t)0x00000000U)         /* !< The peripheral has not been reset
                                                                                    since this bit was last cleared by
                                                                                    RESETSTKYCLR in the RSTCTL register */
#define NPU_STAT_RESETSTKY_RESET           ((uint32_t)0x00010000U)         /* !< The peripheral was reset since the
                                                                                    last bit clear */

