TexasInstruments/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_npu.h
/* NPU_EVT_MODE Bits */
/* NPU_EVT_MODE[INT0_CFG] Bits */
#define NPU_EVT_MODE_INT0_CFG_OFS          (0)                             /* !< INT0_CFG Offset */
#define NPU_EVT_MODE_INT0_CFG_MASK         ((uint32_t)0x00000003U)         /* !< 'Event line mode select for event
                                                                                    corresponding to
                                                                                    [IPSTANDARD.INT_EVENT][0]' */
#define NPU_EVT_MODE_INT0_CFG_DISABLE      ((uint32_t)0x00000000U)         /* !< &apos;The interrupt or event line
                                                                                    is disabled.&apos; */
#define NPU_EVT_MODE_INT0_CFG_SOFTWARE     ((uint32_t)0x00000001U)         /* !< &apos;The interrupt or event line
                                                                                    is in software mode. Software must
                                                                                    clear the RIS.&apos; */
#define NPU_EVT_MODE_INT0_CFG_HARDWARE     ((uint32_t)0x00000002U)         /* !< &apos;The interrupt or event line
                                                                                    is in hardware mode. The hardware
                                                                                    (another module) clears automatically
                                                                                    the associated RIS flag.&apos; */

/* NPU_DESC Bits */
/* NPU_DESC[MODULEID] Bits */
#define NPU_DESC_MODULEID_OFS              (16)                            /* !< MODULEID Offset */
#define NPU_DESC_MODULEID_MASK             ((uint32_t)0xFFFF0000U)         /* !< specifies module id */
/* NPU_DESC[FEATUREVER] Bits */
#define NPU_DESC_FEATUREVER_OFS            (12)                            /* !< FEATUREVER Offset */
#define NPU_DESC_FEATUREVER_MASK           ((uint32_t)0x0000F000U)         /* !< specifies feature version info */
/* NPU_DESC[INSTNUM] Bits */
#define NPU_DESC_INSTNUM_OFS               (8)                             /* !< INSTNUM Offset */
#define NPU_DESC_INSTNUM_MASK              ((uint32_t)0x00000F00U)         /* !< specifies module instance number */
/* NPU_DESC[MAJREV] Bits */
#define NPU_DESC_MAJREV_OFS                (4)                             /* !< MAJREV Offset */
#define NPU_DESC_MAJREV_MASK               ((uint32_t)0x000000F0U)         /* !< specifies major revision id */
/* NPU_DESC[MINREV] Bits */
#define NPU_DESC_MINREV_OFS                (0)                             /* !< MINREV Offset */
#define NPU_DESC_MINREV_MASK               ((uint32_t)0x0000000FU)         /* !< specifies minor revision id */

/* NPU_CTL5 Bits */
/* NPU_CTL5[RUN] Bits */
#define NPU_CTL5_RUN_OFS                   (0)                             /* !< RUN Offset */
#define NPU_CTL5_RUN_MASK                  ((uint32_t)0x00000001U)         /* !< Start the accelerator. Writing a 1
                                                                                    to this bit starts the accelerator.
                                                                                    When the STOP instruction is executed
                                                                                    this bit is cleared by hardware and
                                                                                    DONE interrupt flag is set. */
/* NPU_CTL5[ENIFMAPCIRC] Bits */
#define NPU_CTL5_ENIFMAPCIRC_OFS           (8)                             /* !< ENIFMAPCIRC Offset */
#define NPU_CTL5_ENIFMAPCIRC_MASK          ((uint32_t)0x00000100U)         /* !< Enable circular addressing on input
                                                                                    feature map read address. */
#define NPU_CTL5_ENIFMAPCIRC_DISABLE       ((uint32_t)0x00000000U)
#define NPU_CTL5_ENIFMAPCIRC_ENABLE        ((uint32_t)0x00000100U)         /* !< Enable circular buffering on the
                                                                                    input feature map */
/* NPU_CTL5[ENOFMAPCIRC] Bits */
#define NPU_CTL5_ENOFMAPCIRC_OFS           (9)                             /* !< ENOFMAPCIRC Offset */
#define NPU_CTL5_ENOFMAPCIRC_MASK          ((uint32_t)0x00000200U)         /* !< Enable circular addressing on
                                                                                    output feature map read address. */
#define NPU_CTL5_ENOFMAPCIRC_DISABLE       ((uint32_t)0x00000000U)         /* !< Disable circular buffering on the
                                                                                    output feature map */
#define NPU_CTL5_ENOFMAPCIRC_ENABLE        ((uint32_t)0x00000200U)         /* !< Enable circular buffering on the
                                                                                    output feature map */

/* NPU_CTL4 Bits */
/* NPU_CTL4[OFMAPCIRSTART] Bits */
#define NPU_CTL4_OFMAPCIRSTART_OFS         (0)                             /* !< OFMAPCIRSTART Offset */
#define NPU_CTL4_OFMAPCIRSTART_MASK        ((uint32_t)0x0000FFFFU)         /* !< Circular buffer output feature map
                                                                                    start address. */
/* NPU_CTL4[OFMAPCIREND] Bits */
#define NPU_CTL4_OFMAPCIREND_OFS           (16)                            /* !< OFMAPCIREND Offset */
#define NPU_CTL4_OFMAPCIREND_MASK          ((uint32_t)0xFFFF0000U)         /* !< Circular buffer output feature map
                                                                                    end address. */

/* NPU_CTL3 Bits */
/* NPU_CTL3[IFMAPCIRSTART] Bits */
#define NPU_CTL3_IFMAPCIRSTART_OFS         (0)                             /* !< IFMAPCIRSTART Offset */
#define NPU_CTL3_IFMAPCIRSTART_MASK        ((uint32_t)0x0000FFFFU)         /* !< Circular buffer input feature map
                                                                                    start address */
/* NPU_CTL3[IFMAPCIREND] Bits */
#define NPU_CTL3_IFMAPCIREND_OFS           (16)                            /* !< IFMAPCIREND Offset */
#define NPU_CTL3_IFMAPCIREND_MASK          ((uint32_t)0xFFFF0000U)         /* !< Circular buffer input feature map
                                                                                    end address */

/* NPU_CTL2 Bits */
/* NPU_CTL2[CLLOW] Bits */
#define NPU_CTL2_CLLOW_OFS                 (0)                             /* !< CLLOW Offset */
#define NPU_CTL2_CLLOW_MASK                ((uint32_t)0x000001FFU)         /* !< Lower clamp value */
/* NPU_CTL2[CLHIGH] Bits */
#define NPU_CTL2_CLHIGH_OFS                (16)                            /* !< CLHIGH Offset */
#define NPU_CTL2_CLHIGH_MASK               ((uint32_t)0x01FF0000U)         /* !< Upper clamp value */

/* NPU_CTL1 Bits */
/* NPU_CTL1[IFMAPSTARTHI] Bits */
#define NPU_CTL1_IFMAPSTARTHI_OFS          (0)                             /* !< IFMAPSTARTHI Offset */
#define NPU_CTL1_IFMAPSTARTHI_MASK         ((uint32_t)0x0000FFFFU)         /* !< Start address (Higher 16 bits) of
                                                                                    input feature map data. */
/* NPU_CTL1[OFMAPSTARTHI] Bits */
#define NPU_CTL1_OFMAPSTARTHI_OFS          (16)                            /* !< OFMAPSTARTHI Offset */
#define NPU_CTL1_OFMAPSTARTHI_MASK         ((uint32_t)0xFFFF0000U)         /* !< Start address (Higher 16 bits) of
                                                                                    output feature map data. */

/* NPU_CTL0 Bits */
/* NPU_CTL0[WTYPE] Bits */
#define NPU_CTL0_WTYPE_OFS                 (12)                            /* !< WTYPE Offset */
#define NPU_CTL0_WTYPE_MASK                ((uint32_t)0x0000F000U)         /* !< Weight Type */
#define NPU_CTL0_WTYPE__2T                 ((uint32_t)0x00000000U)         /* !< +1,-1,0 */
#define NPU_CTL0_WTYPE_BINARY              ((uint32_t)0x00001000U)         /* !< Binary data type, +1 or -1 */
#define NPU_CTL0_WTYPE_SIGNED_2BIT         ((uint32_t)0x00002000U)         /* !< Unsigned 8 bit data type */
#define NPU_CTL0_WTYPE_SIGNED_4BIT         ((uint32_t)0x00003000U)         /* !< Signed 4 bit data type */
#define NPU_CTL0_WTYPE_SIGNED_8BIT         ((uint32_t)0x00004000U)         /* !< Signed 8 bit data type */
/* NPU_CTL0[IFMAPTYPE] Bits */
#define NPU_CTL0_IFMAPTYPE_OFS             (0)                             /* !< IFMAPTYPE Offset */
#define NPU_CTL0_IFMAPTYPE_MASK            ((uint32_t)0x0000000FU)         /* !< Input feature map type, */
#define NPU_CTL0_IFMAPTYPE_UNSIGNED_16BIT  ((uint32_t)0x00000000U)
#define NPU_CTL0_IFMAPTYPE_UNSIGNED_8BIT   ((uint32_t)0x00000001U)         /* !< Unsigned 8 bit data type */
#define NPU_CTL0_IFMAPTYPE_UNSIGNED_4BIT   ((uint32_t)0x00000002U)         /* !< Unsigned 4 bit data type */
#define NPU_CTL0_IFMAPTYPE_BINARY          ((uint32_t)0x00000003U)         /* !< Binary data type */
#define NPU_CTL0_IFMAPTYPE_SIGNED_16BIT    ((uint32_t)0x00000008U)
#define NPU_CTL0_IFMAPTYPE_SIGNED_8BIT     ((uint32_t)0x00000009U)         /* !< Signed 8 bit data type */
#define NPU_CTL0_IFMAPTYPE_SIGNED_4BIT     ((uint32_t)0x0000000AU)         /* !< Signed 4 bit data type */
/* NPU_CTL0[OFMAPTYPE] Bits */
#define NPU_CTL0_OFMAPTYPE_OFS             (4)                             /* !< OFMAPTYPE Offset */
#define NPU_CTL0_OFMAPTYPE_MASK            ((uint32_t)0x000000F0U)         /* !< Output feature map type. */
#define NPU_CTL0_OFMAPTYPE_UNSIGNED_16BIT  ((uint32_t)0x00000000U)
#define NPU_CTL0_OFMAPTYPE_UNSIGNED_8BIT   ((uint32_t)0x00000010U)         /* !< Unsigned 8 bit data type */
#define NPU_CTL0_OFMAPTYPE_UNSIGNED_4BIT   ((uint32_t)0x00000020U)         /* !< Unsigned 4 bit data type */
#define NPU_CTL0_OFMAPTYPE_BINARY          ((uint32_t)0x00000030U)         /* !< Binary data type */
#define NPU_CTL0_OFMAPTYPE_SIGNED_16BIT    ((uint32_t)0x00000080U)
#define NPU_CTL0_OFMAPTYPE_SIGNED_8BIT     ((uint32_t)0x00000090U)         /* !< Signed 8 bit data type */
#define NPU_CTL0_OFMAPTYPE_SIGNED_4BIT     ((uint32_t)0x000000A0U)         /* !< Signed 4 bit data type */
/* NPU_CTL0[LAYERTYPE] Bits */
#define NPU_CTL0_LAYERTYPE_OFS             (20)                            /* !< LAYERTYPE Offset */
#define NPU_CTL0_LAYERTYPE_MASK            ((uint32_t)0x01F00000U)         /* !< Layer type */
#define NPU_CTL0_LAYERTYPE_FCONV           ((uint32_t)0x00000000U)
#define NPU_CTL0_LAYERTYPE_DW              ((uint32_t)0x00200000U)
#define NPU_CTL0_LAYERTYPE_PW              ((uint32_t)0x00300000U)
#define NPU_CTL0_LAYERTYPE_CONV            ((uint32_t)0x00500000U)
#define NPU_CTL0_LAYERTYPE_FC              ((uint32_t)0x00600000U)
#define NPU_CTL0_LAYERTYPE_AVGPOOL         ((uint32_t)0x00700000U)
#define NPU_CTL0_LAYERTYPE_MAXPOOL         ((uint32_t)0x00800000U)
#define NPU_CTL0_LAYERTYPE_FCONV_RESIDUAL  ((uint32_t)0x01000000U)
#define NPU_CTL0_LAYERTYPE_DW_RESIDUAL     ((uint32_t)0x01200000U)
#define NPU_CTL0_LAYERTYPE_PW_RESIDUAL     ((uint32_t)0x01300000U)
#define NPU_CTL0_LAYERTYPE_CONV_RESIDUAL   ((uint32_t)0x01500000U)
#define NPU_CTL0_LAYERTYPE_FC_RESIDUAL     ((uint32_t)0x01600000U)
#define NPU_CTL0_LAYERTYPE_AVGPOOL_RESIDUAL ((uint32_t)0x01700000U)
#define NPU_CTL0_LAYERTYPE_MAXPOOL_RESIDUAL ((uint32_t)0x01800000U)
/* NPU_CTL0[RESIFMAPTYPE] Bits */
#define NPU_CTL0_RESIFMAPTYPE_OFS          (26)                            /* !< RESIFMAPTYPE Offset */
#define NPU_CTL0_RESIFMAPTYPE_MASK         ((uint32_t)0x3C000000U)         /* !< Residual Input feature map type, */
#define NPU_CTL0_RESIFMAPTYPE_UNSIGNED_16BIT ((uint32_t)0x00000000U)
#define NPU_CTL0_RESIFMAPTYPE_UNSIGNED_8BIT ((uint32_t)0x04000000U)         /* !< Unsigned 8 bit data type */
#define NPU_CTL0_RESIFMAPTYPE_UNSIGNED_4BIT ((uint32_t)0x08000000U)         /* !< Unsigned 4 bit data type */
#define NPU_CTL0_RESIFMAPTYPE_SIGNED_16BIT ((uint32_t)0x20000000U)
#define NPU_CTL0_RESIFMAPTYPE_SIGNED_8BIT  ((uint32_t)0x24000000U)         /* !< Signed 8 bit data type */
#define NPU_CTL0_RESIFMAPTYPE_SIGNED_4BIT  ((uint32_t)0x28000000U)         /* !< Signed 4 bit data type */

/* NPU_PC Bits */
/* NPU_PC[VALUE] Bits */
#define NPU_PC_VALUE_OFS                   (0)                             /* !< VALUE Offset */
#define NPU_PC_VALUE_MASK                  ((uint32_t)0x0000FFFFU)         /* !< Program count value. */

/* NPU_DATAIN Bits */
/* NPU_DATAIN[VALUE] Bits */
#define NPU_DATAIN_VALUE_OFS               (0)                             /* !< VALUE Offset */
#define NPU_DATAIN_VALUE_MASK              ((uint32_t)0xFFFFFFFFU)         /* !< Data value */

