TexasInstruments/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_npu.h
/* NPU_DATAOUT Bits */
/* NPU_DATAOUT[VALUE] Bits */
#define NPU_DATAOUT_VALUE_OFS              (0)                             /* !< VALUE Offset */
#define NPU_DATAOUT_VALUE_MASK             ((uint32_t)0xFFFFFFFFU)         /* !< Data out value. */

/* NPU_SS0LOW Bits */
/* NPU_SS0LOW[VALUE] Bits */
#define NPU_SS0LOW_VALUE_OFS               (0)                             /* !< VALUE Offset */
#define NPU_SS0LOW_VALUE_MASK              ((uint32_t)0xFFFFFFFFU)         /* !< Value */

/* NPU_SS0HIGH Bits */
/* NPU_SS0HIGH[VALUE] Bits */
#define NPU_SS0HIGH_VALUE_OFS              (0)                             /* !< VALUE Offset */
#define NPU_SS0HIGH_VALUE_MASK             ((uint32_t)0xFFFFFFFFU)         /* !< Value */

/* NPU_SS1LOW Bits */
/* NPU_SS1LOW[VALUE] Bits */
#define NPU_SS1LOW_VALUE_OFS               (0)                             /* !< VALUE Offset */
#define NPU_SS1LOW_VALUE_MASK              ((uint32_t)0xFFFFFFFFU)         /* !< Value */

/* NPU_SS1HIGH Bits */
/* NPU_SS1HIGH[VALUE] Bits */
#define NPU_SS1HIGH_VALUE_OFS              (0)                             /* !< VALUE Offset */
#define NPU_SS1HIGH_VALUE_MASK             ((uint32_t)0xFFFFFFFFU)         /* !< Value */

/* NPU_WGHT0LOW Bits */
/* NPU_WGHT0LOW[VALUE] Bits */
#define NPU_WGHT0LOW_VALUE_OFS             (0)                             /* !< VALUE Offset */
#define NPU_WGHT0LOW_VALUE_MASK            ((uint32_t)0xFFFFFFFFU)         /* !< Value */

/* NPU_WGHT0HIGH Bits */
/* NPU_WGHT0HIGH[VALUE] Bits */
#define NPU_WGHT0HIGH_VALUE_OFS            (0)                             /* !< VALUE Offset */
#define NPU_WGHT0HIGH_VALUE_MASK           ((uint32_t)0xFFFFFFFFU)         /* !< Value */

/* NPU_WGHT1LOW Bits */
/* NPU_WGHT1LOW[VALUE] Bits */
#define NPU_WGHT1LOW_VALUE_OFS             (0)                             /* !< VALUE Offset */
#define NPU_WGHT1LOW_VALUE_MASK            ((uint32_t)0xFFFFFFFFU)         /* !< Value */

/* NPU_WGHT1HIGH Bits */
/* NPU_WGHT1HIGH[VALUE] Bits */
#define NPU_WGHT1HIGH_VALUE_OFS            (0)                             /* !< VALUE Offset */
#define NPU_WGHT1HIGH_VALUE_MASK           ((uint32_t)0xFFFFFFFFU)         /* !< Value */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_NPU__include */

